tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "chezmoi"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jq"
brew "lua"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "switchaudio-osx"
brew "wget"
brew "yazi"
brew "zoxide"
cask "1password-cli"
cask "aerospace"
cask "amethyst"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "raycast"
cask "sf-symbols"
cask "warp"
vscode "1password.op-vscode"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "redhat.java"
vscode "sainnhe.gruvbox-material"
vscode "sswg.swift-lang"
vscode "swiftlang.swift-vscode"
vscode "taotao7.neo-seoul-theme"
vscode "teabyii.ayu"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
